In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
import seaborn as sns

In [10]:
temp_df=pd.DataFrame({
    'City':['NewYork','Chicago','Orlando','SanFrancisco'],'Temperature':[21,14,35,25]})
temp_df

           City  Temperature
0       NewYork           21
1       Chicago           14
2       Orlando           35
3  SanFrancisco           25

In [11]:
windspeed_df=pd.DataFrame({'City':['Chicago','NewYork','Baltimore'],'Windspeed':[6,7,2]})
windspeed_df

        City  Windspeed
0    Chicago          6
1    NewYork          7
2  Baltimore          2

In [25]:
#Default or Inner Join(intersection of both data frames)

In [14]:
pd.merge(temp_df,windspeed_df,on='City')

      City  Temperature  Windspeed
0  NewYork           21          7
1  Chicago           14          6

In [19]:
#Full Outer Join(Union of two data frames

In [18]:
pd.merge(temp_df,windspeed_df,on='City',how='outer')

           City  Temperature  Windspeed
0     Baltimore          NaN        2.0
1       Chicago         14.0        6.0
2       NewYork         21.0        7.0
3       Orlando         35.0        NaN
4  SanFrancisco         25.0        NaN

In [20]:
#Left Join

In [22]:
pd.merge(temp_df,windspeed_df,on='City',how='left')

           City  Temperature  Windspeed
0       NewYork           21        7.0
1       Chicago           14        6.0
2       Orlando           35        NaN
3  SanFrancisco           25        NaN

In [23]:
#Right join

In [24]:
pd.merge(temp_df,windspeed_df,on='City',how='right')

        City  Temperature  Windspeed
0    Chicago         14.0          6
1    NewYork         21.0          7
2  Baltimore          NaN          2

In [26]:
#concat on basis of rows

In [28]:
pd.concat([temp_df,windspeed_df])

           City  Temperature  Windspeed
0       NewYork         21.0        NaN
1       Chicago         14.0        NaN
2       Orlando         35.0        NaN
3  SanFrancisco         25.0        NaN
0       Chicago          NaN        6.0
1       NewYork          NaN        7.0
2     Baltimore          NaN        2.0

In [29]:
#concat on basis of columns

In [30]:
pd.concat([temp_df,windspeed_df],axis=1)

           City  Temperature       City  Windspeed
0       NewYork           21    Chicago        6.0
1       Chicago           14    NewYork        7.0
2       Orlando           35  Baltimore        2.0
3  SanFrancisco           25        NaN        NaN